RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7xx_HAL/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_ospi.c
#if defined (USE_HAL_OSPI_REGISTER_CALLBACKS) && (USE_HAL_OSPI_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User OSPI Callback
  *         To be used to override the weak predefined callback
  * @param hospi : OSPI handle
  * @param CallbackID : ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_OSPI_ERROR_CB_ID          OSPI Error Callback ID
  *          @arg @ref HAL_OSPI_ABORT_CB_ID          OSPI Abort Callback ID
  *          @arg @ref HAL_OSPI_FIFO_THRESHOLD_CB_ID OSPI FIFO Threshold Callback ID
  *          @arg @ref HAL_OSPI_CMD_CPLT_CB_ID       OSPI Command Complete Callback ID
  *          @arg @ref HAL_OSPI_RX_CPLT_CB_ID        OSPI Rx Complete Callback ID
  *          @arg @ref HAL_OSPI_TX_CPLT_CB_ID        OSPI Tx Complete Callback ID
  *          @arg @ref HAL_OSPI_RX_HALF_CPLT_CB_ID   OSPI Rx Half Complete Callback ID
  *          @arg @ref HAL_OSPI_TX_HALF_CPLT_CB_ID   OSPI Tx Half Complete Callback ID
  *          @arg @ref HAL_OSPI_STATUS_MATCH_CB_ID   OSPI Status Match Callback ID
  *          @arg @ref HAL_OSPI_TIMEOUT_CB_ID        OSPI Timeout Callback ID
  *          @arg @ref HAL_OSPI_MSP_INIT_CB_ID       OSPI MspInit callback ID
  *          @arg @ref HAL_OSPI_MSP_DEINIT_CB_ID     OSPI MspDeInit callback ID
  * @param pCallback : pointer to the Callback function
  * @retval status
  */
HAL_StatusTypeDef HAL_OSPI_RegisterCallback(OSPI_HandleTypeDef *hospi, HAL_OSPI_CallbackIDTypeDef CallbackID,
                                            pOSPI_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hospi->ErrorCode |= HAL_OSPI_ERROR_INVALID_CALLBACK;
    return HAL_ERROR;
  }

  if (hospi->State == HAL_OSPI_STATE_READY)
  {
    switch (CallbackID)
    {
      case  HAL_OSPI_ERROR_CB_ID :
        hospi->ErrorCallback = pCallback;
        break;
      case HAL_OSPI_ABORT_CB_ID :
        hospi->AbortCpltCallback = pCallback;
        break;
      case HAL_OSPI_FIFO_THRESHOLD_CB_ID :
        hospi->FifoThresholdCallback = pCallback;
        break;
      case HAL_OSPI_CMD_CPLT_CB_ID :
        hospi->CmdCpltCallback = pCallback;
        break;
      case HAL_OSPI_RX_CPLT_CB_ID :
        hospi->RxCpltCallback = pCallback;
        break;
      case HAL_OSPI_TX_CPLT_CB_ID :
        hospi->TxCpltCallback = pCallback;
        break;
      case HAL_OSPI_RX_HALF_CPLT_CB_ID :
        hospi->RxHalfCpltCallback = pCallback;
        break;
      case HAL_OSPI_TX_HALF_CPLT_CB_ID :
        hospi->TxHalfCpltCallback = pCallback;
        break;
      case HAL_OSPI_STATUS_MATCH_CB_ID :
        hospi->StatusMatchCallback = pCallback;
        break;
      case HAL_OSPI_TIMEOUT_CB_ID :
        hospi->TimeOutCallback = pCallback;
        break;
      case HAL_OSPI_MSP_INIT_CB_ID :
        hospi->MspInitCallback = pCallback;
        break;
      case HAL_OSPI_MSP_DEINIT_CB_ID :
        hospi->MspDeInitCallback = pCallback;
        break;
      default :
        /* Update the error code */
        hospi->ErrorCode |= HAL_OSPI_ERROR_INVALID_CALLBACK;
        /* update return status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (hospi->State == HAL_OSPI_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_OSPI_MSP_INIT_CB_ID :
        hospi->MspInitCallback = pCallback;
        break;
      case HAL_OSPI_MSP_DEINIT_CB_ID :
        hospi->MspDeInitCallback = pCallback;
        break;
      default :
        /* Update the error code */
        hospi->ErrorCode |= HAL_OSPI_ERROR_INVALID_CALLBACK;
        /* update return status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hospi->ErrorCode |= HAL_OSPI_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Unregister a User OSPI Callback
  *         OSPI Callback is redirected to the weak predefined callback
  * @param hospi : OSPI handle
  * @param CallbackID : ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_OSPI_ERROR_CB_ID          OSPI Error Callback ID
  *          @arg @ref HAL_OSPI_ABORT_CB_ID          OSPI Abort Callback ID
  *          @arg @ref HAL_OSPI_FIFO_THRESHOLD_CB_ID OSPI FIFO Threshold Callback ID
  *          @arg @ref HAL_OSPI_CMD_CPLT_CB_ID       OSPI Command Complete Callback ID
  *          @arg @ref HAL_OSPI_RX_CPLT_CB_ID        OSPI Rx Complete Callback ID
  *          @arg @ref HAL_OSPI_TX_CPLT_CB_ID        OSPI Tx Complete Callback ID
  *          @arg @ref HAL_OSPI_RX_HALF_CPLT_CB_ID   OSPI Rx Half Complete Callback ID
  *          @arg @ref HAL_OSPI_TX_HALF_CPLT_CB_ID   OSPI Tx Half Complete Callback ID
  *          @arg @ref HAL_OSPI_STATUS_MATCH_CB_ID   OSPI Status Match Callback ID
  *          @arg @ref HAL_OSPI_TIMEOUT_CB_ID        OSPI Timeout Callback ID
  *          @arg @ref HAL_OSPI_MSP_INIT_CB_ID       OSPI MspInit callback ID
  *          @arg @ref HAL_OSPI_MSP_DEINIT_CB_ID     OSPI MspDeInit callback ID
  * @retval status
  */
HAL_StatusTypeDef HAL_OSPI_UnRegisterCallback(OSPI_HandleTypeDef *hospi, HAL_OSPI_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hospi->State == HAL_OSPI_STATE_READY)
  {
    switch (CallbackID)
    {
      case  HAL_OSPI_ERROR_CB_ID :
        hospi->ErrorCallback = HAL_OSPI_ErrorCallback;
        break;
      case HAL_OSPI_ABORT_CB_ID :
        hospi->AbortCpltCallback = HAL_OSPI_AbortCpltCallback;
        break;
      case HAL_OSPI_FIFO_THRESHOLD_CB_ID :
        hospi->FifoThresholdCallback = HAL_OSPI_FifoThresholdCallback;
        break;
      case HAL_OSPI_CMD_CPLT_CB_ID :
        hospi->CmdCpltCallback = HAL_OSPI_CmdCpltCallback;
        break;
      case HAL_OSPI_RX_CPLT_CB_ID :
        hospi->RxCpltCallback = HAL_OSPI_RxCpltCallback;
        break;
      case HAL_OSPI_TX_CPLT_CB_ID :
        hospi->TxCpltCallback = HAL_OSPI_TxCpltCallback;
        break;
      case HAL_OSPI_RX_HALF_CPLT_CB_ID :
        hospi->RxHalfCpltCallback = HAL_OSPI_RxHalfCpltCallback;
        break;
      case HAL_OSPI_TX_HALF_CPLT_CB_ID :
        hospi->TxHalfCpltCallback = HAL_OSPI_TxHalfCpltCallback;
        break;
      case HAL_OSPI_STATUS_MATCH_CB_ID :
        hospi->StatusMatchCallback = HAL_OSPI_StatusMatchCallback;
        break;
      case HAL_OSPI_TIMEOUT_CB_ID :
        hospi->TimeOutCallback = HAL_OSPI_TimeOutCallback;
        break;
      case HAL_OSPI_MSP_INIT_CB_ID :
        hospi->MspInitCallback = HAL_OSPI_MspInit;
        break;
      case HAL_OSPI_MSP_DEINIT_CB_ID :
        hospi->MspDeInitCallback = HAL_OSPI_MspDeInit;
        break;
      default :
        /* Update the error code */
        hospi->ErrorCode |= HAL_OSPI_ERROR_INVALID_CALLBACK;
        /* update return status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (hospi->State == HAL_OSPI_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_OSPI_MSP_INIT_CB_ID :
        hospi->MspInitCallback = HAL_OSPI_MspInit;
        break;
      case HAL_OSPI_MSP_DEINIT_CB_ID :
        hospi->MspDeInitCallback = HAL_OSPI_MspDeInit;
        break;
      default :
        /* Update the error code */
        hospi->ErrorCode |= HAL_OSPI_ERROR_INVALID_CALLBACK;
        /* update return status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hospi->ErrorCode |= HAL_OSPI_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  HAL_ERROR;
  }

